?- trace_unif([a?=a]).
systeme : [a?=a]
clean : a?=a

YES

***********************************************************

?- trace_unif([X?=X]).
systeme : [_3652?=_3652]
clean : _3652?=_3652

YES

***********************************************************

?- trace_unif([f(a)?=f(a)]).
systeme : [f(a)?=f(a)]
clean : f(a)?=f(a)

YES

***********************************************************

?- trace_unif([f(a)?=f(b)]).
systeme : [f(a)?=f(b)]
decompose : f(a)?=f(b)
systeme : [a?=b]
const : a?=b

NO

***********************************************************

?- trace_unif([f(a)?=g(a)]).
systeme : [f(a)?=g(a)]
clash : f(a)?=g(a)

NO

***********************************************************

?- trace_unif([f(X)?=g(X)]).
systeme : [f(_8526)?=g(_8526)]
clash : f(_8526)?=g(_8526)

NO

***********************************************************

?- trace_unif([X ?= f(b)]).
systeme : [_10136?=f(b)]
expand : _10136?=f(b)

YES

***********************************************************

?- trace_unif([f(a)?=f(X)]).
systeme : [f(a)?=f(_12148)]
decompose : f(a)?=f(_12148)
systeme : [a?=_12148]
orient : a?=_12148
systeme : [_12148?=a]
simplify : _12148?=a

YES

***********************************************************

?- trace_unif([a?=X]).
systeme : [a?=_13422]
orient : a?=_13422
systeme : [_13422?=a]
simplify : _13422?=a

YES

***********************************************************

?- trace_unif([a?=f(a)]).
systeme : [a?=f(a)]
const : a?=f(a)

NO

***********************************************************

?- trace_unif([X?=a]).
systeme : [_14?=a]
simplify : _14?=a

YES

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], premier).
systeme : [f(_6802,_6804)?=f(g(_6808),h(a)),_6808?=f(_6804)]
decompose : f(_6802,_6804)?=f(g(_6808),h(a))
systeme : [_6802?=g(_6808),_6804?=h(a),_6808?=f(_6804)]
expand : _6802?=g(_6808)
systeme : [_6804?=h(a),_6808?=f(_6804)]
expand : _6804?=h(a)
systeme : [_6808?=f(h(a))]
expand : _6808?=f(h(a))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], pondere).
systeme : [f(_12040,_12042)?=f(g(_12046),h(a)),_12046?=f(_12042)]
decompose : f(_12040,_12042)?=f(g(_12046),h(a))
systeme : [_12040?=g(_12046),_12042?=h(a),_12046?=f(_12042)]
expand : _12040?=g(_12046)
systeme : [_12042?=h(a),_12046?=f(_12042)]
expand : _12042?=h(a)
systeme : [_12046?=f(h(a))]
expand : _12046?=f(h(a))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], random).
systeme : [_2446?=f(_2442),f(_2440,_2442)?=f(g(_2446),h(a))]
expand : _2446?=f(_2442)
systeme : [f(_2440,_2442)?=f(g(f(_2442)),h(a))]
decompose : f(_2440,_2442)?=f(g(f(_2442)),h(a))
systeme : [_2442?=h(a),_2440?=g(f(_2442))]
expand : _2442?=h(a)
systeme : [_2440?=g(f(h(a)))]
expand : _2440?=g(f(h(a)))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], premier).
systeme : [f(_940,_942)?=f(g(_946),h(a)),_946?=f(_940)]
decompose : f(_940,_942)?=f(g(_946),h(a))
systeme : [_940?=g(_946),_942?=h(a),_946?=f(_940)]
expand : _940?=g(_946)
systeme : [_942?=h(a),_946?=f(g(_946))]
expand : _942?=h(a)
systeme : [_946?=f(g(_946))]
check : _946?=f(g(_946))

NO

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], pondere).
systeme : [f(_112,_114)?=f(g(_118),h(a)),_118?=f(_112)]
decompose : f(_112,_114)?=f(g(_118),h(a))
systeme : [_112?=g(_118),_114?=h(a),_118?=f(_112)]
expand : _112?=g(_118)
systeme : [_118?=f(g(_118)),_114?=h(a)]
check : _118?=f(g(_118))

NO

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], random).
systeme : [f(_2142,_2144)?=f(g(_2148),h(a)),_2148?=f(_2142)]
decompose : f(_2142,_2144)?=f(g(_2148),h(a))
systeme : [_2148?=f(_2142),_2142?=g(_2148),_2144?=h(a)]
expand : _2148?=f(_2142)
systeme : [_2142?=g(f(_2142)),_2144?=h(a)]
check : _2142?=g(f(_2142))

NO

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], premier).
systeme : [f(_12,_14)?=f(g(_16),h(a)),_16?=f(_14)]
decompose : f(_12,_14)?=f(g(_16),h(a))
systeme : [_12?=g(_16),_14?=h(a),_16?=f(_14)]
expand : _12?=g(_16)
systeme : [_14?=h(a),_16?=f(_14)]
expand : _14?=h(a)
systeme : [_16?=f(h(a))]
expand : _16?=f(h(a))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], pondere).
systeme : [f(_1584,_1586)?=f(g(_1590),h(a)),_1590?=f(_1586)]
decompose : f(_1584,_1586)?=f(g(_1590),h(a))
systeme : [_1584?=g(_1590),_1586?=h(a),_1590?=f(_1586)]
expand : _1584?=g(_1590)
systeme : [_1586?=h(a),_1590?=f(_1586)]
expand : _1586?=h(a)
systeme : [_1590?=f(h(a))]
expand : _1590?=f(h(a))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(Y)], random).
systeme : [f(_122,_124)?=f(g(_128),h(a)),_128?=f(_124)]
decompose : f(_122,_124)?=f(g(_128),h(a))
systeme : [_128?=f(_124),_122?=g(_128),_124?=h(a)]
expand : _128?=f(_124)
systeme : [_124?=h(a),_122?=g(f(_124))]
expand : _124?=h(a)
systeme : [_6?=g(f(h(a)))]
expand : _6?=g(f(h(a)))

YES

X = g(f(h(a))),
Y = h(a),
Z = f(h(a)).

***********************************************************

?- 
|    trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], premier).
systeme : [f(_126,_128)?=f(g(_132),h(a)),_132?=f(_126)]
decompose : f(_126,_128)?=f(g(_132),h(a))
systeme : [_126?=g(_132),_128?=h(a),_132?=f(_126)]
expand : _126?=g(_132)
systeme : [_128?=h(a),_132?=f(g(_132))]
expand : _128?=h(a)
systeme : [_10?=f(g(_10))]
check : _10?=f(g(_10))

NO

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], pondere).
systeme : [f(_18,_20)?=f(g(_24),h(a)),_24?=f(_18)]
decompose : f(_18,_20)?=f(g(_24),h(a))
systeme : [_18?=g(_24),_20?=h(a),_24?=f(_18)]
expand : _18?=g(_24)
systeme : [_24?=f(g(_24)),_20?=h(a)]
check : _24?=f(g(_24))

NO

***********************************************************

?- trace_unif([f(X,Y) ?= f(g(Z),h(a)), Z ?= f(X)], random).
systeme : [_16?=f(_12),f(_12,_14)?=f(g(_16),h(a))]
expand : _16?=f(_12)
systeme : [f(_12,_14)?=f(g(f(_12)),h(a))]
decompose : f(_12,_14)?=f(g(f(_12)),h(a))
systeme : [_12?=g(f(_12)),_14?=h(a)]
check : _12?=g(f(_12))

NO

***********************************************************

?- trace_unif([Z?=X, X?=f(a), Z?=f(b)], premier).
systeme : [_154?=_156,_156?=f(a),_154?=f(b)]
rename : _154?=_156
systeme : [_154?=f(a),_154?=f(b)]
expand : _154?=f(a)
systeme : [f(a)?=f(b)]
decompose : f(a)?=f(b)
systeme : [a?=b]
const : a?=b

NO

***********************************************************

?- trace_unif([Z?=X, X?=f(a), Z?=f(b)], pondere).
systeme : [_154?=_156,_156?=f(a),_154?=f(b)]
rename : _154?=_156
systeme : [_154?=f(a),_154?=f(b)]
expand : _154?=f(a)
systeme : [f(a)?=f(b)]
decompose : f(a)?=f(b)
systeme : [a?=b]
const : a?=b

NO

***********************************************************

?- trace_unif([Z?=X, X?=f(a), Z?=f(b)], random).
systeme : [_2282?=f(b),_2282?=_2284,_2284?=f(a)]
expand : _2282?=f(b)
systeme : [_2284?=f(a),f(b)?=_2284]
expand : _2284?=f(a)
systeme : [f(b)?=f(a)]
decompose : f(b)?=f(a)
systeme : [b?=a]
const : b?=a

NO

***********************************************************

?- 
|    trace_unif([Z?=X, X?=f(a), Z?=f(a)], premier).
systeme : [_2322?=_2324,_2324?=f(a),_2322?=f(a)]
rename : _2322?=_2324
systeme : [_2322?=f(a),_2322?=f(a)]
expand : _2322?=f(a)
systeme : [f(a)?=f(a)]
clean : f(a)?=f(a)

YES

Z = X, X = f(a).

***********************************************************

?- trace_unif([Z?=X, X?=f(a), Z?=f(a)], pondere).
systeme : [_374?=_376,_376?=f(a),_374?=f(a)]
rename : _374?=_376
systeme : [_6?=f(a)]
expand : _6?=f(a)

YES

Z = X, X = f(a).

***********************************************************

?- trace_unif([Z?=X, X?=f(a), Z?=f(a)], random).
systeme : [_2288?=f(a),_2288?=_2290,_2290?=f(a)]
expand : _2288?=f(a)
systeme : [_2290?=f(a),f(a)?=_2290]
expand : _2290?=f(a)
systeme : [f(a)?=f(a)]
clean : f(a)?=f(a)

YES

Z = X, X = f(a).

***********************************************************

?- 
|    trace_unif([f(X,X,Y) ?= f(f(Y,Y,Z),f(Y,Y,Z),a)], premier).
systeme : [f(_44,_44,_48)?=f(f(_48,_48,_56),f(_48,_48,_56),a)]
decompose : f(_44,_44,_48)?=f(f(_48,_48,_56),f(_48,_48,_56),a)
systeme : [_44?=f(_48,_48,_56),_44?=f(_48,_48,_56),_48?=a]
expand : _44?=f(_48,_48,_56)
systeme : [f(_48,_48,_56)?=f(_48,_48,_56),_48?=a]
clean : f(_48,_48,_56)?=f(_48,_48,_56)
systeme : [_48?=a]
simplify : _48?=a

YES

X = f(a, a, Z),
Y = a.

***********************************************************

?- trace_unif([f(X,X,Y) ?= f(f(Y,Y,Z),f(Y,Y,Z),a)], pondere).
systeme : [f(_1806,_1806,_1810)?=f(f(_1810,_1810,_1818),f(_1810,_1810,_1818),a)]
decompose : f(_1806,_1806,_1810)?=f(f(_1810,_1810,_1818),f(_1810,_1810,_1818),a)
systeme : [_1810?=a,_1806?=f(_1810,_1810,_1818),_1806?=f(_1810,_1810,_1818)]
simplify : _1810?=a
systeme : [_1806?=f(a,a,_1818)]
expand : _1806?=f(a,a,_1818)

YES

X = f(a, a, Z),
Y = a.

***********************************************************

?- trace_unif([f(X,X,Y) ?= f(f(Y,Y,Z),f(Y,Y,Z),a)], random).
systeme : [f(_38,_38,_40)?=f(f(_40,_40,_42),f(_40,_40,_42),a)]
decompose : f(_38,_38,_40)?=f(f(_40,_40,_42),f(_40,_40,_42),a)
systeme : [_40?=a,_38?=f(_40,_40,_42),_38?=f(_40,_40,_42)]
simplify : _40?=a
systeme : [_38?=f(a,a,_42)]
expand : _38?=f(a,a,_42)

YES

X = f(a, a, Z),
Y = a.

***********************************************************

?- 
|    trace_unif([f(x,x,y) ?= f(f(y,y,z),f(y,y,z),a)], premier).
systeme : [f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)]
decompose : f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)
systeme : [x?=f(y,y,z),x?=f(y,y,z),y?=a]
const : x?=f(y,y,z)

NO

***********************************************************

?- trace_unif([f(x,x,y) ?= f(f(y,y,z),f(y,y,z),a)], pondere).
systeme : [f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)]
decompose : f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)
systeme : [x?=f(y,y,z),y?=a]
const : x?=f(y,y,z)

NO

***********************************************************

?- trace_unif([f(x,x,y) ?= f(f(y,y,z),f(y,y,z),a)], random).
systeme : [f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)]
decompose : f(x,x,y)?=f(f(y,y,z),f(y,y,z),a)
systeme : [y?=a,x?=f(y,y,z),x?=f(y,y,z)]
const : y?=a

NO

***********************************************************

?- 
|    trace_unif([f(X,X,X)?=f(f(Y,Y,Y),f(Y,Y,Z),a)], premier).
systeme : [f(_828,_828,_828)?=f(f(_836,_836,_836),f(_836,_836,_848),a)]
decompose : f(_828,_828,_828)?=f(f(_836,_836,_836),f(_836,_836,_848),a)
systeme : [_828?=f(_836,_836,_836),_828?=f(_836,_836,_848),_828?=a]
expand : _828?=f(_836,_836,_836)
systeme : [f(_836,_836,_836)?=f(_836,_836,_848),f(_836,_836,_836)?=a]
decompose : f(_836,_836,_836)?=f(_836,_836,_848)
systeme : [_836?=_836,_836?=_836,_836?=_848,f(_836,_836,_836)?=a]
clean : _836?=_836
systeme : [_836?=_836,_836?=_848,f(_836,_836,_836)?=a]
clean : _836?=_836
systeme : [_836?=_848,f(_836,_836,_836)?=a]
rename : _836?=_848
systeme : [f(_836,_836,_836)?=a]
const : f(_836,_836,_836)?=a

NO

***********************************************************

?- trace_unif([f(X,X,X)?=f(f(Y,Y,Y),f(Y,Y,Z),a)], pondere).
systeme : [f(_18,_18,_18)?=f(f(_26,_26,_26),f(_26,_26,_38),a)]
decompose : f(_18,_18,_18)?=f(f(_26,_26,_26),f(_26,_26,_38),a)
systeme : [_18?=a,_18?=f(_26,_26,_26),_18?=f(_26,_26,_38)]
simplify : _18?=a
systeme : [a?=f(_26,_26,_26),a?=f(_26,_26,_38)]
const : a?=f(_26,_26,_26)

NO

***********************************************************

?- trace_unif([f(X,X,X)?=f(f(Y,Y,Y),f(Y,Y,Z),a)], random).
systeme : [f(_1436,_1436,_1436)?=f(f(_1444,_1444,_1444),f(_1444,_1444,_1456),a)]
decompose : f(_1436,_1436,_1436)?=f(f(_1444,_1444,_1444),f(_1444,_1444,_1456),a)
systeme : [_1436?=a,_1436?=f(_1444,_1444,_1444),_1436?=f(_1444,_1444,_1456)]
simplify : _1436?=a
systeme : [a?=f(_1444,_1444,_1456),a?=f(_1444,_1444,_1444)]
const : a?=f(_1444,_1444,_1456)

NO

***********************************************************

?- trace_unif([f(Z)?=f(Y), Y?=f(b), X?=f(X)], premier).
systeme : [f(_156)?=f(_160),_160?=f(b),_192?=f(_192)]
decompose : f(_156)?=f(_160)
systeme : [_156?=_160,_160?=f(b),_192?=f(_192)]
rename : _156?=_160
systeme : [_156?=f(b),_192?=f(_192)]
expand : _156?=f(b)
systeme : [_192?=f(_192)]
check : _192?=f(_192)

NO

***********************************************************

?- trace_unif([f(Z)?=f(Y), Y?=f(b), X?=f(X)], pondere).
systeme : [_1406?=f(_1406),f(_1370)?=f(_1374),_1374?=f(b)]
check : _1406?=f(_1406)

NO

***********************************************************

?- trace_unif([f(Z)?=f(Y), Y?=f(b), X?=f(X)], random).
systeme : [f(_2154)?=f(_2158),_2158?=f(b),_2190?=f(_2190)]
decompose : f(_2154)?=f(_2158)
systeme : [_2190?=f(_2190),_2154?=_2158,_2158?=f(b)]
check : _2190?=f(_2190)

NO

***********************************************************
